export default {
  title: '贡献',
  welcome: {
    title: '贡献给 Equal UI',
    description:
      '欢迎为 Equal UI 做出贡献！如果你有兴趣帮助改进该项目，请花点时间阅读本文档，了解如何参与进来。',
  },
  contributeWays: {
    title: '贡献方式',
    description: '有很多方式可以为 Equal UI 做出贡献，包括：',
    way1: {
      label: '报告错误：',
      content:
        '如果你在项目中发现了错误，请通过在项目的问题跟踪器中创建一个问题来报告。请确保尽可能提供详细信息，包括你使用的项目版本和你收到的任何错误消息。',
    },
    way2: {
      label: '修复错误：',
      content:
        '如果你有兴趣修复错误，请查看项目的问题跟踪器中的开放问题，并查看是否有任何你可以帮助的问题。',
    },
    way3: {
      label: '添加新功能：',
      content:
        '如果你有一个对项目有益的新功能的想法，请创建一个问题与项目维护人员讨论。如果该功能被接受，可以随时提交一个带有你的实现的拉取请求。',
    },
    way4: {
      label: '改进文档：',
      content:
        '如果你注意到项目的文档不足或可以改进，请提交一个带有你的更改的拉取请求。',
    },
    way5: {
      label: '提供反馈：',
      content:
        '如果你对该项目有任何反馈（无论是好的还是坏的），请通过在项目的问题跟踪器中创建一个问题来分享。',
    },
  },
  submissionSteps: {
    title: '提交更改',
    description: '要提交对 Equal UI 的更改，请按照以下步骤操作：',
    step1: {
      label: 'Fork 该仓库：',
      content:
        '将该项目的仓库 Fork 到你自己的 GitHub 账户。这将创建一个你可以对其进行更改的仓库副本。',
    },
    step2: {
      label: '创建一个新分支：',
      content:
        '在你的仓库分支上创建一个新分支以进行你的更改。这有助于将你的更改组织和与项目中的其他工作分开。',
    },
    step3: {
      label: '进行你的更改：',
      content:
        '进行你想要提交给项目的更改。确保遵循项目的编码风格和规范，并确保你的更改有良好的文档。',
    },
    step4: {
      label: '提交你的更改：',
      content:
        '将你的更改提交到你的新分支。确保编写一个清晰描述你的更改的良好提交信息。',
    },
    step5: {
      label: '提交一个拉取请求：',
      content:
        '提交一个拉取请求到项目的仓库。在拉取请求中，确保解释你的更改是做了什么以及为什么它们是必要的。',
    },
  },
  codeOfConduct: {
    title: '行为准则',
    description: '通过参与这个项目，你同意遵守该项目的',
  },
  contact: {
    title: '联系方式',
    description: '如果你有任何问题或需要帮助入门，请随时联系项目维护人员。',
  },
  thanks: '感谢你对 Equal UI 的贡献兴趣！',
}
